cask_args appdir: '/Applications'

#taps
tap "caskroom/cask"

# Shell stuff
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Development Stuff
brew "vim"
brew "chruby"
brew "ruby-install"
brew 'nodejs'
brew 'npm'
brew 'sqlite'
brew 'jq'
brew 'chromedriver'
brew 'git'
brew 'git-lfs'
brew 'ansible'
brew 'ack'

#utilities
brew "wget"
brew "ag"
brew "awscli"
brew "fzf"

# Linters
brew "shellcheck"

# Applications
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'virtualbox'
cask 'vagrant'
cask 'spotify'
cask 'evernote'
cask 'royal-tsx'
cask 'android-studio'
cask 'postman'
cask 'java'
cask 'discord'
cask 'sketchup'
cask 'authy-desktop'
cask 'steam'

