cask_args appdir: '/Applications'

#taps
tap "caskroom/cask"

# Shell stuff
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Development Stuff
brew "vim"
brew "chruby"
brew "ruby-install"
brew 'nodejs'
brew 'npm'
brew 'sqlite'
brew 'jq'
brew 'chromedriver'

#utilities
brew "wget"
brew "ack"
brew 'awscli'

# Linters
brew "shellcheck"

# Applications Proper
cask 'google-chrome'
cask 'google-photos-backup-and-sync'
cask 'iterm2'
cask 'virtualbox'
cask 'vagrant'
cask 'spotify'
cask 'evernote'
cask 'royal-tsx'
cask 'divvy'
cask 'android-studio'
cask 'postman'

