# Shell stuff
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Development Stuff
brew "vim"
brew "chruby"
brew "ruby-install"
brew 'nodejs'
brew 'npm'
brew 'sqlite'
brew 'jq'
brew 'chromedriver'

#utilities
brew "wget"
brew "ack"
brew 'awscli'

# Linters
brew "shellcheck"

